tests/data/entities/payment_intent.json

{
  "id": "pi_MvrKl2JNA29nkGB",
  "amount": 1.5,
  "object": "payment_intent",
  "status": "waiting_payment",
  "customer": {
    "id": "cus_OZxelV2Bg5EoAQ0",
    "email": "john.doe@example.com",
    "object": "customer",
    "last_name": "Doe",
    "first_name": "John"
  },
  "payments": [],
  "fiat_amount": 1.5,
  "paid_amount": 0,
  "created_date": 1665645215,
  "currency_code": "USDC",
  "currency": {
    "id": "cur_OZxelV2Bg5EoAQ0",
    "object": "currency",
    "code": "USDC",
    "blockchain": "ethereum",
    "coin_type": "erc20"
  },
  "exchange_rate": 1,
  "paid_fiat_amount": 0,
  "fees": {
    "object": "fee",
    "amount": 1,
    "fiat_amount": 1.5,
    "currency": {
      "id": "cur_OZxelV2Bg5EoAQ0",
      "object": "currency",
      "code": "USDC",
      "blockchain": "ethereum",
      "coin_type": "erc20"
    },
    "fiat_currency_code": "USD"
  }
}
